app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "description", "start_time", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 24 Jan 2016 04:39:10 UTC +00:00], ["description", ""], ["start_time", Sun, 24 Jan 2016 00:00:00 UTC +00:00], ["title", ""], ["updated_at", Sun, 24 Jan 2016 04:39:10 UTC +00:00]]